[
  {
    "id": "100",
    "character_name": "Batman",
    "poster": "https://images.alphacoders.com/440/thumb-1920-44041.jpg",
    "description": "One of the most iconic fictional characters in the world, Batman has dedicated his life to an endless crusade, a war on all criminals in the name of his murdered parent, who were taken from him when he was just a child. Since that tragic night, he has trained his body and mind to near physical perfection to be a self-made Super Hero",
    "Cast": "Christ Bale, Robert Patinson, Jenson Ackles"
  },
  {
    "id": "101",
    "character_name": "Superman",
    "poster": "https://wallpapercave.com/wp/h6CUqRv.jpg",
    "description": "Faster than a speeding bullet, more powerful than a locomotive… The Man of Steel fights a never-ending battle for truth, justice, and the American way.",
    "Cast": "Bardon Routh, Henry Cavill, Christopher Reeve"
  },
  {
    "id": "102",
    "character_name": "THE FLASH",
    "poster": "https://wallpapercave.com/wp/wp1829329.jpg",
    "description": "The mysterious power known as the Speed Force is an energy field that has, over the centuries, granted incredible powers of velocity to certain heroes. The most famous of these is the Flash, also known as the Fastest Man Alive.",
    "Cast": "Grant Gustin"
  },
  {
    "id": "103",
    "character_name": "GREEN LANTERN",
    "poster": "https://wallpapercave.com/wp/wp2950413.jpg",
    "description": "Test pilot Hal Jordan went from being a novelty, the first-ever human Green Lantern, to one of the most legendary Lanterns to ever wield a power ring.Hal Jordan’s life was changed twice by crashing aircraft. The first time was when he witnessed the death of his father, pilot Martin Jordan. The second was when, as an adult and trained pilot himself, he was summoned to the crashed wreckage of a spaceship belonging to an alien named Abin Sur.",
    "Cast": "Ryan Reynolds"
  },
  {
    "id": "104",
    "character_name": "WONDER WOMAN",
    "poster": "https://wallpapercave.com/wp/wp3864551.jpg",
    "description": "Beautiful as Aphrodite, wise as Athena, swifter than Hermes, and stronger than Hercules, Princess Diana of Themyscira fights for peace in Man's World.",
    "Cast": "Gal Gadot"
  }
]
